01_Dummy_cases/02_A02_Rotor/03_A02_Dummy_MRF/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
compressible 0;

#if #calc "${compressible} == 1"
    //Compressible
    thermoType
    {
        type            hePsiThermo;
        mixture         pureMixture;
        transport       const;
        thermo          hConst;
        equationOfState perfectGas;
        specie          specie;
        energy          sensibleEnthalpy;
    }

    mixture
    {
        specie
        {
            molWeight   28.9;
        }
        thermodynamics
        {
            Cp          1005;
            Hf          0;
        }
        transport
        {
            mu          1.82e-05;
            Pr          0.71;
        }
    }
#else 
	//Incompressible
	viscosityModel  constant;
	nu              [0 2 -1 0 0 0 0] 1.5e-05;
	rho             [1 -3 0 0 0 0 0] 1.225;
#endif


// ************************************************************************* //
